ESBQualificationToolConsumerLauncher/src/META-INF/wsdl/192.168.0.100_9080/ESBQualificationToolCompositeApp-sun-http-binding/192.168.0.101_8080/ESBQualificationToolProducer/WebServiceProducerService.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.3.1-hudson-417-SNAPSHOT. -->
<!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.3.1-hudson-417-SNAPSHOT. -->
<definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://webservices.esbqualificationtool.com/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema" name="WebServiceProducerService" targetNamespace="http://webservices.esbqualificationtool.com/">
<types>
<xsd:schema>
<xsd:import namespace="http://webservices.esbqualificationtool.com/" schemaLocation="http://192.168.0.101:8080/ESBQualificationToolProducer/WebServiceProducerService?xsd=1"/>
</xsd:schema>
</types>
<message name="QualificationToolService">
<part element="tns:QualificationToolService" name="parameters"/>
</message>
<message name="QualificationToolServiceResponse">
<part element="tns:QualificationToolServiceResponse" name="parameters"/>
</message>
<portType name="WebServiceProducer">
<operation name="QualificationToolService">
<input message="tns:QualificationToolService"/>
<output message="tns:QualificationToolServiceResponse"/>
</operation>
</portType>
<binding name="WebServiceProducerPortBinding" type="tns:WebServiceProducer">
<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
<operation name="QualificationToolService">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
</binding>
<service name="WebServiceProducerService">
<port binding="tns:WebServiceProducerPortBinding" name="WebServiceProducerPort">
<soap:address location="http://192.168.0.101:8080/ESBQualificationToolProducer/WebServiceProducerService"/>
</port>
</service>
</definitions>
